{"/about/":{"data":{"":"Links \u0026 Docs An Open Initiative by Links and Joints Studios. To bring the Hands-on experience of the Industrial Practices and tid-bits to make you a Robotics Wizard.","contributors#Contributors":"Koustav Betal Runs linters in parallel, reuses Go build cache and caches analysis results."},"title":"_index"},"/docs/amr-docs/":{"data":{"":"welcome to amr-doc"},"title":"AMR-Docs"},"/docs/amr-docs/create-a-ros2-robot/":{"data":{"":"","gazebo#Gazebo":"","gazebo-1#Gazebo":"","joint-state-publisher#Joint State Publisher":"","key-notes#Key Notes":"","nav2#Nav2":"In this series, we documented everything to create an advance near industrial grade Autonomous Mobile Robot or AMR which uses State-of-the-art mathematical theories into practices along with some AI fundamentals as well.\nPrerequisites Robot Operating System (ROS2) The Robot Operating System (ROS) is a set of software libraries and tools for building robot applications. From drivers and state-of-the-art algorithms to powerful developer tools, ROS has the open source tools you need for your next robotics project.\nGazebo Gazebo Sim is an open source robotics simulator. Through Gazebo Sim, users have access to high fidelity physics, rendering, and sensor models. Additionally, users and developers have multiple points of entry to simulation including a graphical user interface, plugins, and asynchronous message passing and services.\nros2_control The ros2_control is a framework for (real-time) control of robots using ROS 2. Its packages are a rewrite of ros_control packages used in ROS. ros2_control’s goal is to simplify integrating new hardware and overcome some drawbacks.\nNav2 Nav2 is the professionally-supported successor of the ROS Navigation Stack deploying the same kinds of technology powering Autonomous Vehicles brought down, optimized, and reworked for mobile and surface robotics.","prerequisites#Prerequisites":"","robot-operating-system-ros2#Robot Operating System (ROS2)":"","robot-state-publisher#Robot State Publisher:":"","ros-gz-bridge#ros-gz-bridge":"","ros2_#ros2_control":"","ros2_control#ros2_control":"","rviz#rviz":"","slam_toolbox#slam_toolbox":""},"title":"create a ros2 robot w/ ros2_control, nav2"},"/docs/amr-docs/robot-state-publisher/":{"data":{"":"jkaskd ufhieu f kh afuhfo lakf ifhelk\nprint(\"this is koustav betal\")"},"title":"Robot State Publisher"},"/docs/amr-docs/ros2_control/":{"data":{"":"hgchgchg"},"title":"ros2_control"},"/docs/amr-docs/ros2_control/hgvhodcvdsuhfv/":{"data":{"":"hbigiyijbk"},"title":"hgvhodcvdsuhfv"},"/docs/test-doc/testy/":{"data":{"":"jkaskd ufhieu f kh afuhfo lakf ifhelk"},"title":"testy"},"/guides/how-to-git/":{"data":{"":"Install Git sudo apt install git Debian Only\nGlobal Config Configuring user information used across all local repositories\nSet Username git config --global user.name set a name that is identifiable for credit when review version history\nSet User Email git config --global user.email set an email address that will be associated with each history marker\nInitialise Repository Configuring user information, initializing, and cloning repositories\nInitialise a Directory as Repository git init Initialize an existing directory as a Git repository\nDownload a Repository (from GitHub) git clone Retrieve an entire repository from a hosted location through URL\nStatus of Repository Theory of staging(add), upstaging(remove) and committing Staged → Commit (→ Push)\nCheck the Status: status git status Shows any kind of modifications of files in working directory and whether staged for your next commit.\nStage a file: add git add Adds a Specific file to a staging area To stage every single changed files or folder to the staged area use dot (.) instead of from the working.\ngit add . Unstage a file: reset git reset Unstage a file while retaining the changes in working directory Similarly, to unstage everything use dot(.) instead of . To reset everything from the previous or defined commit use: --hard flag.\ngit reset --hard Verify the Differences: diff git diff Verify the difference of what is changed but not staged *And to check the differences of what is changed and also staged but not yet committed add the --staged flag:\ngit diff --staged Commit: commit git commit -m \"\" commit your staged content as a new commit snapshot -m flag is used to type the message to determine about the changes afterwards, If we do not use this, another separate window like “nano” will popup to enter a commit message, which increases the complexity, without any benefit.\nPush Repository (Staged → Commit →) push | fetch | pull | merge","add-remote-repository-remote-add#\u003cstrong\u003eAdd Remote Repository:\u003c/strong\u003e \u003ccode\u003eremote add\u003c/code\u003e":"git remote add alias: is like the initial branch alias, i.e. ‘origin‘. url: is the url of the remote repository i.e. https://github.com/koustavbetal/dotfiles","check-the-status-status#\u003cstrong\u003eCheck the Status:\u003c/strong\u003e \u003ccode\u003estatus\u003c/code\u003e":"","commit-commit#\u003cstrong\u003eCommit:\u003c/strong\u003e \u003ccode\u003ecommit\u003c/code\u003e":"","download-a-repository#\u003cstrong\u003eDownload a Repository \u003cem\u003e(from GitHub)\u003c/em\u003e\u003c/strong\u003e":"","fetching-the-recent-changes-fetch#\u003cstrong\u003eFetching the Recent Changes:\u003c/strong\u003e \u003ccode\u003efetch\u003c/code\u003e":"git fetch \\It fetches the recent changes (only the hashes, it is not same as pull) from the remote repository.","global-config#Global Config":"","initialise-a-directory-as-repository#\u003cstrong\u003eInitialise a Directory as Repository\u003c/strong\u003e":"","initialise-repository#Initialise Repository":"","install-git#Install Git":"","merge-two-branches-commit#\u003cstrong\u003eMerge two Branches:\u003c/strong\u003e \u003ccode\u003ecommit\u003c/code\u003e":"git merge / Merge a remote branch into your current branch to bring it up to date.","pull-the-repository--pull#\u003cstrong\u003ePull the Repository \u003cem\u003e(from GitHub)\u003c/em\u003e:\u003c/strong\u003e \u003ccode\u003epull\u003c/code\u003e":"git pull Fetch and merge any commits from the tracking remote branch. No flag is required, as there is only a single repository mapped to the remote.","push-a-file-push#\u003cstrong\u003ePush a file:\u003c/strong\u003e \u003ccode\u003epush\u003c/code\u003e":"git push branch: This is the branch where you want to push the changes. Transmit local branch commits to the remote repository branch.","push-repository#Push Repository":"","re-base-history-rebase#\u003cstrong\u003eRe-base History:\u003c/strong\u003e \u003ccode\u003erebase\u003c/code\u003e":"git rebase It adds or pushes your current changes as the original base of that git branch, It is a risky command in collaborative project yet very useful to mitigate errors. To prevent that from happening, always it is recommended to use fetch before doing any kind changes to the files.","set-user-email#\u003cstrong\u003eSet User Email\u003c/strong\u003e":"","set-username#\u003cstrong\u003eSet Username\u003c/strong\u003e":"","stage-a-file-add#\u003cstrong\u003eStage a file:\u003c/strong\u003e \u003ccode\u003eadd\u003c/code\u003e":"","status-of-repository#Status of Repository":"","unstage-a-file-reset#\u003cstrong\u003eUnstage a file:\u003c/strong\u003e \u003ccode\u003ereset\u003c/code\u003e":"","verify-the-differences-diff#\u003cstrong\u003eVerify the Differences:\u003c/strong\u003e \u003ccode\u003ediff\u003c/code\u003e":""},"title":"How to Git"},"/guides/ros2-101/":{"data":{"key-notes#Key Notes":"Key Notes AuRoClean™ is an Acronym for “Autonomous Robot for Cleaning”, Initially made in collaboration with BARC in ROS(1) framework, with minimal Autonomous Behaviour[^1]. Current version of AuRoClean™ is developed on the ROS2 middleware with Nav2 and slam_toolbox for complete autonomous operation of the robot."},"title":"ROS2 101"},"/guides/setting-up-microros/":{"data":{"":"In this guide we will setup complete micro-ros setup from installing PlatformIO on VSCode and then installing the agent onto the main machine installed with ROS2 Jazzy.","install-platformio-for-vscode#Install PlatformIO for VSCode:":"Install VSCode, if you haven’t already sudo snap install code --classic # Assuming you are on Ubuntu Install PlatformIO extension for VSCode by navigating to: extensions (ctrl+shift+x) \u003e search “platformio ide” \u003e Install OR, code --install-extension platformio.platformio-ide After Installing the extension, Click on the PlatformIO button or clicking the home button on status bar or by searching “platfomio home” on command palette (ctrl+shift+p)","prerequisites#Prerequisites":"Basic idea of micro-controllers and ROS(2). Some hardware related experience for connecting IO pins properly. Basics of electronics, voltage and current requirements for used components.","setting-up-platformio#Setting up PlatformIO":"After Installing the extension,\nInstall the requirement dependencies mentioned here. sudo apt install -y git cmake python3-pip Open VSCode Navigate to PlatformIo Home by, Clicking on the PlatformIO button or, clicking the home button on status bar or, by searching “platfomio home” on command palette (ctrl+shift+p) Create a new project Click on Create Project Give a proper name Select board according to your model (i.e. DOIT ESP Devkit V1) Keep the framework to “Arduino” Save it in a recognisable place (uncheck the locaton option to turn off default location). Note: To open the project later you only have to open this specific older where the .ini file is stored.\nYour text goes here. It will automatically occupy whatever space is left after giving 30% to the video. You can add multiple lines, formatted content, or even buttons here. Reprehenderit ullamco adipisicing velit officia fugiat. Qui cillum pariatur laboris officia cillum aliquip. Occaecat anim aute laboris minim esse do mollit proident. Esse mollit reprehenderit ad dolor velit ad magna et. Nostrud adipisicing voluptate sint adipisicing veniam exercitation. Excepteur ad voluptate excepteur duis reprehenderit enim excepteur labore sunt id eu quis. Enim voluptate ad proident occaecat dolor officia ullamco laborum aute aliquip.","why-platformio#Why PlatformIO?":"Easy to setup Mostly automated and takes care all the compiling and uploading part all by itself."},"title":"MicroROS Setup"},"/guides/urdf-wizard/":{"data":{"key-notes#Key Notes":"Key Notes AuRoClean™ is an Acronym for “Autonomous Robot for Cleaning”, Initially made in collaboration with BARC in ROS(1) framework, with minimal Autonomous Behaviour[^1]. Current version of AuRoClean™ is developed on the ROS2 middleware with Nav2 and slam_toolbox for complete autonomous operation of the robot."},"title":"Become URDF Wizard"},"/members/author/":{"data":{"":"","experience#Experience":"","rubotsh-technologies-llp#Rubotsh Technologies LLP.":"","technologies-used#Technologies Used":"Fast Runs linters in parallel, reuses Go build cache and caches analysis results.\nIntegrations Integrations with VS Code, Sublime Text, GoLand, GNU Emacs, Vim, GitHub Actions.\nNice outputs Text with colors and source code lines, JSON, tab, HTML, Checkstyle, Code-Climate, JUnit-XML, TeamCity, SARIF.\nMinimum number of false positives Tuned default settings.\nA lot of linters No need to install them.\nYAML-based configuration Easy to read and maintain.","together-solutions-pvt-ltd#Together Solutions Pvt. Ltd.":"Koustav Betal Roboticist | Creator of LnJ Studios To bring the Hands-on experience of the Industrial Practices and tid-bits to make you a Robotics Wizard. Experience Rubotsh Technologies LLP. This is the first step. kjbk\nTogether Solutions Pvt. Ltd. This is the second step."},"title":"_index"},"/members/koustav/":{"data":{"":"","experience#Experience":"","rubotsh-technologies-llp#Rubotsh Technologies LLP.":"","technologies-used#Technologies Used":"Fast Runs linters in parallel, reuses Go build cache and caches analysis results.\nIntegrations Integrations with VS Code, Sublime Text, GoLand, GNU Emacs, Vim, GitHub Actions.\nNice outputs Text with colors and source code lines, JSON, tab, HTML, Checkstyle, Code-Climate, JUnit-XML, TeamCity, SARIF.\nMinimum number of false positives Tuned default settings.\nA lot of linters No need to install them.\nYAML-based configuration Easy to read and maintain.","together-solutions-pvt-ltd#Together Solutions Pvt. Ltd.":"Koustav Betal Roboticist | Creator of LnJ Studios To bring the Hands-on experience of the Industrial Practices and tid-bits to make you a Robotics Wizard. Experience Rubotsh Technologies LLP. This is the first step. kjbk\nTogether Solutions Pvt. Ltd. This is the second step."},"title":"_index"}}